#### Tofu Plan Output - observability_stack_ctrl_plane_k8s
```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

OpenTofu will perform the following actions:

[1m  # google_service_account_iam_binding.argocd_sa[0m will be created
[0m  [32m+[0m[0m resource "google_service_account_iam_binding" "argocd_sa" {
      [32m+[0m[0m etag               = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m members            = [
          [32m+[0m[0m "serviceAccount:ctrl-plane-prod-b1b92df2.svc.id.goog[argocd/argocd-application-controller]",
          [32m+[0m[0m "serviceAccount:ctrl-plane-prod-b1b92df2.svc.id.goog[argocd/argocd-server]",
        ]
      [32m+[0m[0m role               = "roles/iam.serviceAccountUser"
      [32m+[0m[0m service_account_id = "projects/ctrl-plane-prod-b1b92df2/serviceAccounts/db-exporter-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
    }

[1m  # google_service_account_iam_binding.argocd_sa_token_creator[0m will be created
[0m  [32m+[0m[0m resource "google_service_account_iam_binding" "argocd_sa_token_creator" {
      [32m+[0m[0m etag               = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m members            = [
          [32m+[0m[0m "serviceAccount:ctrl-plane-prod-b1b92df2.svc.id.goog[argocd/argocd-application-controller]",
          [32m+[0m[0m "serviceAccount:ctrl-plane-prod-b1b92df2.svc.id.goog[argocd/argocd-server]",
        ]
      [32m+[0m[0m role               = "roles/iam.serviceAccountTokenCreator"
      [32m+[0m[0m service_account_id = "projects/ctrl-plane-prod-b1b92df2/serviceAccounts/db-exporter-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
    }

[1m  # helm_release.argocd[0m will be updated in-place
[0m  [33m~[0m[0m resource "helm_release" "argocd" {
      [33m~[0m[0m id                         = "argocd" -> (known after apply)
      [33m~[0m[0m metadata                   = {
          [33m~[0m[0m app_version    = "v2.13.3" -> (known after apply)
          [33m~[0m[0m chart          = "argo-cd" -> (known after apply)
          [33m~[0m[0m first_deployed = 1740052426 -> (known after apply)
          [33m~[0m[0m last_deployed  = 1741089230 -> (known after apply)
          [33m~[0m[0m name           = "argocd" -> (known after apply)
          [33m~[0m[0m namespace      = "argocd" -> (known after apply)
          [33m~[0m[0m notes          = <<-EOT
                In order to access the server UI you have the following options:
                
                1. kubectl port-forward service/argocd-server -n argocd 8080:443
                
                    and then open the browser on http://localhost:8080 and accept the certificate
                
                2. enable ingress in the values file 'server.ingress.enabled' and either
                      - Add the annotation for ssl passthrough: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-1-ssl-passthrough
                      - Set the 'configs.params."server.insecure"' in the values file and terminate SSL at your ingress: https://argo-cd.readthedocs.io/en/stable/operator-manual/ingress/#option-2-multiple-ingress-objects-and-hosts
                
                
                After reaching the UI the first time you can login with username: admin and the random password generated during the installation. You can find the password by running:
                
                kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath="{.data.password}" | base64 -d
                
                (You should delete the initial secret afterwards as suggested by the Getting Started Guide: https://argo-cd.readthedocs.io/en/stable/getting_started/#4-login-using-the-cli)
            EOT -> (known after apply)
          [33m~[0m[0m revision       = 9 -> (known after apply)
          [33m~[0m[0m values         = jsonencode({}) -> (known after apply)
          [33m~[0m[0m version        = "7.7.15" -> (known after apply)
        } -> (known after apply)
        name                       = "argocd"
      [31m-[0m[0m postrender                 = {
          [31m-[0m[0m args        = [] [90m-> null[0m[0m
          [31m-[0m[0m binary_path = "" [90m-> null[0m[0m
        } [90m-> null[0m[0m
      [31m-[0m[0m set                        = [] [90m-> null[0m[0m
      [31m-[0m[0m set_list                   = [] [90m-> null[0m[0m
      [31m-[0m[0m set_sensitive              = [] [90m-> null[0m[0m
      [31m-[0m[0m set_wo_revision            = 1 [90m-> null[0m[0m
      [33m~[0m[0m values                     = [
          [31m-[0m[0m <<-EOT
                global:
                  image:
                    tag: "v2.13.3"
                  logging:
                    format: json
                  domain: "argocd.observability.internal.falkordb.cloud"
                server:
                  extraArgs:
                    - --insecure
                  ingress:
                    enabled: true
                    controller: gke
                    tls: true
                    gke:
                      managedCertificate:
                        create: true
                    annotations:
                      kubernetes.io/ingress.global-static-ip-name: "argocd-ip"
                
                cmp:
                  repositories:
                    falkordb-dbaas:
                      url: https://github.com/FalkorDB/falkordb-dbaas
                
                configs:
                  secret:
                    createSecret: false
                  cm:
                    url: https://argocd.observability.internal.falkordb.cloud
                    dex.config: |
                      connectors:
                      - config:
                          issuer: https://accounts.google.com
                          clientID: $dex.google.clientId
                          clientSecret: $dex.google.clientSecret
                          serviceAccountFilePath: /tmp/oidc/googleAuth.json
                          adminEmail: $dex.google.adminEmail
                          fetchTransitiveGroupMembership: True
                        type: oidc
                        id: google
                        name: Google
                  rbac:
                    create: true
                    policy.default: role:readonly
                    policy.csv: |
                      g, devops@falkordb.com, role:org-admin
                    scopes: "[groups, email]"
                
                dex:
                  volumeMounts:
                    - mountPath: /tmp/oidc
                      name: google-json
                      readOnly: true
                  volumes:
                    - name: google-json
                      secret:
                        defaultMode: 420
                        secretName: argocd-google-groups
                
                applicationSet:
                  resources:
                    requests:
                      memory: "2Gi"
                      cpu: "500m"
                    limits: 
                      memory: "4Gi"
                      cpu: "2"
                
                controller:
                  replicas: 2
                  metrics:
                    enabled: true
                  template:
                    spec: 
                      containers:
                        - name: argocd-application-controller
                          env:
                            - name: ARGOCD_CONTROLLER_REPLICAS
                              value: "2"
                
                  resources:
                    requests:
                      memory: "2Gi"
                      cpu: "1"
                    limits: 
                      memory: "6Gi"
                      cpu: "2"
                
                extraObjects:
                  - apiVersion: argoproj.io/v1alpha1
                    kind: Application
                    metadata:
                      name: ctrl-plane-observability-stack
                    spec:
                      project: default
                      source:
                        repoURL: https://github.com/FalkorDB/falkordb-dbaas.git
                        targetRevision: main
                        path: argocd/ctrl_plane/prod
                      destination:
                        server: https://kubernetes.default.svc
                      syncPolicy:
                        automated: {}
                
                  - apiVersion: argoproj.io/v1alpha1
                    kind: Application
                    metadata:
                      name: app-plane-observability-stack
                    spec:
                      project: default
                      source:
                        repoURL: https://github.com/FalkorDB/falkordb-dbaas.git
                        targetRevision: main
                        path: argocd/app_plane/prod
                      destination:
                        server: https://kubernetes.default.svc
                      syncPolicy:
                        automated: {}
            EOT,
          [32m+[0m[0m <<-EOT
                global:
                  image:
                    tag: "v2.13.3"
                  logging:
                    format: json
                  domain: "argocd.observability.internal.falkordb.cloud"
                server:
                  extraArgs:
                    - --insecure
                  ingress:
                    enabled: true
                    controller: gke
                    tls: true
                    gke:
                      managedCertificate:
                        create: true
                    annotations:
                      kubernetes.io/ingress.global-static-ip-name: "argocd-ip"
                  serviceAccount:
                    annotations:
                      iam.gke.io/gcp-service-account: "argocd-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
                  volumes:
                    - name: aws-profile
                      secret:
                        secretName: aws-profile
                  volumeMounts:
                    - name: aws-profile
                      mountPath: /home/argocd/.aws
                      readOnly: true
                
                cmp:
                  repositories:
                    falkordb-dbaas:
                      url: https://github.com/FalkorDB/falkordb-dbaas
                
                configs:
                  secret:
                    createSecret: false
                  cm:
                    url: https://argocd.observability.internal.falkordb.cloud
                    dex.config: |
                      connectors:
                      - config:
                          issuer: https://accounts.google.com
                          clientID: $dex.google.clientId
                          clientSecret: $dex.google.clientSecret
                          serviceAccountFilePath: /tmp/oidc/googleAuth.json
                          adminEmail: $dex.google.adminEmail
                          fetchTransitiveGroupMembership: True
                        type: oidc
                        id: google
                        name: Google
                  rbac:
                    create: true
                    policy.default: role:readonly
                    policy.csv: |
                      g, devops@falkordb.com, role:org-admin
                    scopes: "[groups, email]"
                
                dex:
                  volumeMounts:
                    - mountPath: /tmp/oidc
                      name: google-json
                      readOnly: true
                  volumes:
                    - name: google-json
                      secret:
                        defaultMode: 420
                        secretName: argocd-google-groups
                
                applicationSet:
                  resources:
                    requests:
                      memory: "2Gi"
                      cpu: "500m"
                    limits:
                      memory: "4Gi"
                      cpu: "2"
                
                controller:
                  replicas: 2
                  metrics:
                    enabled: true
                  template:
                    spec:
                      containers:
                        - name: argocd-application-controller
                          env:
                            - name: ARGOCD_CONTROLLER_REPLICAS
                              value: "2"
                  serviceAccount:
                    annotations:
                      iam.gke.io/gcp-service-account: "argocd-sa@ctrl-plane-prod-b1b92df2.iam.gserviceaccount.com"
                  resources:
                    requests:
                      memory: "2Gi"
                      cpu: "1"
                    limits:
                      memory: "6Gi"
                      cpu: "2"
                  volumes:
                    - name: aws-profile
                      secret:
                        secretName: aws-profile
                  volumeMounts:
                    - name: aws-profile
                      mountPath: /home/argocd/.aws
                      readOnly: true
                
                extraObjects:
                  - apiVersion: argoproj.io/v1alpha1
                    kind: Application
                    metadata:
                      name: ctrl-plane-observability-stack
                    spec:
                      project: default
                      source:
                        repoURL: https://github.com/FalkorDB/falkordb-dbaas.git
                        targetRevision: main
                        path: argocd/ctrl_plane/prod
                      destination:
                        server: https://kubernetes.default.svc
                      syncPolicy:
                        automated: {}
                
                  - apiVersion: argoproj.io/v1alpha1
                    kind: Application
                    metadata:
                      name: app-plane-observability-stack
                    spec:
                      project: default
                      source:
                        repoURL: https://github.com/FalkorDB/falkordb-dbaas.git
                        targetRevision: main
                        path: argocd/app_plane/prod
                      destination:
                        server: https://kubernetes.default.svc
                      syncPolicy:
                        automated: {}
            EOT,
        ]
      [33m~[0m[0m version                    = "7.7.15" [33m->[0m[0m "8.3.0"
        [90m# (25 unchanged attributes hidden)[0m[0m
    }

[1m  # kubernetes_secret.argocd-secret[0m will be updated in-place
[0m  [33m~[0m[0m resource "kubernetes_secret" "argocd-secret" {
      [33m~[0m[0m data                           = (sensitive value)
        id                             = "argocd/argocd-secret"
        [90m# (3 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 2 to add, 2 to change, 0 to destroy.
[0m
```
    